Revit 2024 API
ParameterMap.ReverseIterator Method
Retrieve a backward moving iterator to the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual ParameterMapIterator ReverseIterator()
Visual Basic
Public Overridable Function ReverseIterator As ParameterMapIterator
Visual C++
public:
virtual ParameterMapIterator^ ReverseIterator()
Return Value
Returns a backward moving iterator to the map.
See Also
ParameterMap Class
Autodesk.Revit.DB Namespace